In [1]:
import pandas as pd

In [2]:
data_largo = {
    'Producto': ['A', 'A', 'B', 'B', 'C', 'C'],
    'Mes': ['Enero', 'Febrero', 'Enero', 'Febrero', 'Enero', 'Febrero'],
    'Ventas': [100, 150, 200, 250, 300, 350]
}

df_largo = pd.DataFrame(data_largo)
display(df_largo)

  Producto      Mes  Ventas
0        A    Enero     100
1        A  Febrero     150
2        B    Enero     200
3        B  Febrero     250
4        C    Enero     300
5        C  Febrero     350

In [3]:
df_ancho = df_largo.pivot(index='Producto', columns='Mes', values='Ventas')
display(df_ancho)

Mes       Enero  Febrero
Producto
A           100      150
B           200      250
C           300      350

In [5]:
df_largo_de_nuevo = pd.melt(df_ancho.reset_index(), id_vars=['Producto'], value_vars=['Enero', 'Febrero'], var_name='Mes', value_name='Ventas')
display(df_largo_de_nuevo )
display(df_largo)

  Producto      Mes  Ventas
0        A    Enero     100
1        B    Enero     200
2        C    Enero     300
3        A  Febrero     150
4        B  Febrero     250
5        C  Febrero     350

  Producto      Mes  Ventas
0        A    Enero     100
1        A  Febrero     150
2        B    Enero     200
3        B  Febrero     250
4        C    Enero     300
5        C  Febrero     350